tap "1password/tap"
tap "epk/epk"
tap "go-task/tap"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "homeport/tap"
tap "morantron/tmux-fingers"
tap "noahgorstein/tap"
tap "sst/tap"
tap "steipete/tap"
tap "wtfox/tap"
brew "libiconv"
brew "git"
brew "asdf"
brew "aws-cdk"
brew "bash"
brew "bat"
brew "cfssl"
brew "cloc"
brew "cloud-sql-proxy"
brew "ripgrep"
brew "codex"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-compose"
brew "docutils"
brew "dpkg"
brew "ducker"
brew "dust"
brew "eksctl"
brew "exiftool"
brew "eza"
brew "findutils"
brew "fzf"
brew "fzf-tab"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "glow"
brew "unbound"
brew "go"
brew "goimports"
brew "golangci-lint"
brew "gopls"
brew "graphviz"
brew "hadolint"
brew "helix"
brew "helm"
brew "htop"
brew "icu4c@76"
brew "jless"
brew "jq"
brew "jqp"
brew "jsonlint"
brew "k3d"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "kustomize"
brew "lazygit"
brew "lf"
brew "libpq"
brew "lua-language-server"
brew "lychee"
brew "mactop"
brew "markdownlint-cli"
brew "marksman"
brew "mise"
brew "mosh", args: ["HEAD"]
brew "neovim"
brew "neovide", link: false
brew "nvm"
brew "openldap"
brew "postgresql@14"
brew "pyright"
brew "re2"
brew "reattach-to-user-namespace"
brew "ruff"
brew "runit"
brew "shellcheck"
brew "skopeo"
brew "sponge"
brew "ssh-audit"
brew "starship"
brew "stern"
brew "stow"
brew "telnet"
brew "tflint"
brew "tig"
brew "tmux"
brew "tpm"
brew "tree"
brew "typescript-language-server"
brew "unzip"
brew "up"
brew "uv"
brew "vale"
brew "vcluster"
brew "watch"
brew "wget"
brew "wrkflw"
brew "yaml-language-server"
brew "yamlfmt"
brew "yamllint"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform-ls"
brew "homeport/tap/dyff"
brew "morantron/tmux-fingers/tmux-fingers"
brew "sst/tap/opencode"
brew "wtfox/tap/jsonfind"
cask "1password"
cask "1password-cli"
cask "arc"
cask "beekeeper-studio"
cask "bettershot"
cask "chatgpt"
cask "chromedriver"
cask "claude"
cask "cursor"
cask "firefox"
cask "flameshot"
cask "font-jetbrains-mono-nerd-font"
cask "epk/epk/font-sf-mono-nerd-font"
cask "ghostty"
cask "glide-browser"
cask "google-chrome"
cask "handy"
cask "heynote"
cask "hot"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "launchos"
cask "loom"
cask "meetingbar"
cask "neovide-app"
cask "netnewswire"
cask "obsidian"
cask "orion"
cask "qmk-toolbox"
cask "rancher"
cask "rapidapi"
cask "raycast"
cask "shottr"
cask "slack"
cask "smoothcsv"
cask "spotify"
cask "stats"
cask "superwhisper"
cask "tomatobar"
cask "topnotch"
cask "via"
cask "vial"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "waterfox"
cask "wezterm"
cask "windows-app"
cask "zed"
cask "zen"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "vscodevim.vim"
go "cmd/go"
go "cmd/gofmt"
