tap "1password/tap"
tap "epk/epk"
tap "federico-terzi/espanso"
tap "go-task/tap"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "homeport/tap"
tap "jdxcode/tap"
tap "noahgorstein/tap"
brew "coreutils"
brew "asdf"
brew "bash"
brew "bat"
brew "brew-cask-completion"
brew "cfssl"
brew "cloc"
brew "cloud-sql-proxy"
brew "colordiff"
brew "curl"
brew "diffutils"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-compose"
brew "python@3.12"
brew "docutils"
brew "dpkg"
brew "eksctl"
brew "exiftool"
brew "findutils"
brew "flux"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "glab"
brew "glow"
brew "unbound"
brew "go"
brew "golangci-lint"
brew "helix"
brew "helm"
brew "htop"
brew "jless"
brew "jq"
brew "jsonlint"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "kustomize"
brew "lazygit"
brew "lf"
brew "libiconv"
brew "libpq"
brew "lua-language-server"
brew "markdownlint-cli"
brew "marksman"
brew "mise"
brew "mosh", args: ["HEAD"]
brew "neofetch"
brew "neovim"
brew "openldap"
brew "podman"
brew "postgresql@14"
brew "pre-commit"
brew "pyright"
brew "python@3.11"
brew "python@3.9"
brew "re2"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruff"
brew "ruff-lsp"
brew "runit"
brew "shellcheck"
brew "skopeo"
brew "sponge"
brew "ssh-audit"
brew "starship"
brew "stern"
brew "stow"
brew "telnet"
brew "terraform"
brew "tflint"
brew "tig"
brew "tmux"
brew "tree"
brew "unzip"
brew "uv"
brew "vale"
brew "vault"
brew "vcluster"
brew "watch"
brew "wget"
brew "yaml-language-server"
brew "yamllint"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform-ls"
brew "homeport/tap/dyff"
brew "noahgorstein/tap/jqp"
cask "1password"
cask "1password-cli"
cask "arc"
cask "beekeeper-studio"
cask "chatgpt"
cask "chromedriver"
cask "cursor"
cask "espanso"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sf-mono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "heynote"
cask "hiddenbar"
cask "hot"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "meetingbar"
cask "netnewswire"
cask "notion"
cask "obsidian"
cask "onyx"
cask "orion"
cask "qmk-toolbox"
cask "rancher"
cask "rapidapi"
cask "raycast"
cask "rocket"
cask "shottr"
cask "slack"
cask "spotify"
cask "stats"
cask "tomatobar"
cask "topnotch"
cask "via"
cask "vial"
cask "vlc"
cask "vscodium"
cask "wezterm"
cask "zen-browser"
