tap "epk/epk"
tap "federico-terzi/espanso"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "brew-cask-completion"
brew "openldap"
brew "curl"
brew "htop"
brew "python@3.9"
brew "reattach-to-user-namespace"
brew "stow"
brew "federico-terzi/espanso/espanso"
cask "alacritty"
cask "dozer"
cask "eul"
cask "font-hack-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sf-mono-nerd-font"
cask "google-chrome"
cask "karabiner-elements"
cask "meetingbar"
cask "notunes"
cask "raycast"
cask "shottr"
cask "vagrant"
cask "virtualbox"
