tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "epk/epk"
brew "brew-cask-completion"
brew "python@3.9"
brew "curl"
brew "htop"
brew "neovim"
brew "reattach-to-user-namespace"
brew "stow"
cask "dozer"
cask "eul"
cask "font-hack-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sf-mono-nerd-font"
cask "monitorcontrol"
cask "notunes"
cask "rectangle"
cask "vagrant"
cask "virtualbox"
