{
  "plugins": {
    "auto-hlsearch.nvim": {
      "src": "https://github.com/asiryk/auto-hlsearch.nvim"
    },
    "blink-cmp-copilot": {
      "src": "https://github.com/giuxtaposition/blink-cmp-copilot"
    },
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp",
      "version": "1.0.0 - 1.1.0"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "copilot.lua": {
      "src": "https://github.com/zbirenbaum/copilot.lua"
    },
    "diffview.nvim": {
      "src": "https://github.com/sindrets/diffview.nvim"
    },
    "dressing.nvim": {
      "src": "https://github.com/stevearc/dressing.nvim"
    },
    "fugitive-delta.nvim": {
      "src": "https://github.com/farhanmustar/fugitive-delta.nvim"
    },
    "fugitive-gitlab.vim": {
      "src": "https://github.com/shumphrey/fugitive-gitlab.vim"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua"
    },
    "github-nvim-theme": {
      "src": "https://github.com/projekt0n/github-nvim-theme"
    },
    "go.nvim": {
      "src": "https://github.com/ray-x/go.nvim"
    },
    "gv.vim": {
      "src": "https://github.com/junegunn/gv.vim"
    },
    "incr.nvim": {
      "src": "https://github.com/daliusd/incr.nvim"
    },
    "koda.nvim": {
      "src": "https://github.com/oskarnurm/koda.nvim"
    },
    "live-preview.nvim": {
      "src": "https://github.com/brianhuster/live-preview.nvim"
    },
    "marksman": {
      "src": "https://github.com/artempyanykh/marksman"
    },
    "mini.nvim": {
      "src": "https://github.com/echasnovski/mini.nvim"
    },
    "neogit": {
      "src": "https://github.com/NeogitOrg/neogit"
    },
    "nightfox.nvim": {
      "src": "https://github.com/EdenEast/nightfox.nvim"
    },
    "no-clown-fiesta.nvim": {
      "src": "https://github.com/aktersnurra/no-clown-fiesta.nvim"
    },
    "nord.nvim": {
      "src": "https://github.com/shaunsingh/nord.nvim"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim-bqf": {
      "src": "https://github.com/kevinhwang91/nvim-bqf"
    },
    "nvim-lint": {
      "src": "https://github.com/mfussenegger/nvim-lint"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-tree-preview.lua": {
      "src": "https://github.com/b0o/nvim-tree-preview.lua"
    },
    "nvim-tree.lua": {
      "src": "https://github.com/kyazdani42/nvim-tree.lua"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/kyazdani42/nvim-web-devicons"
    },
    "octo.nvim": {
      "src": "https://github.com/pwntester/octo.nvim"
    },
    "onedark.nvim": {
      "src": "https://github.com/navarasu/onedark.nvim"
    },
    "onenord.nvim": {
      "src": "https://github.com/rmehri01/onenord.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "schemastore.nvim": {
      "src": "https://github.com/b0o/schemastore.nvim"
    },
    "scope.nvim": {
      "src": "https://github.com/tiagovla/scope.nvim"
    },
    "vim-commandcaps": {
      "src": "https://github.com/takac/vim-commandcaps"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive"
    },
    "vim-markdown": {
      "src": "https://github.com/preservim/vim-markdown"
    },
    "vim-rhubarb": {
      "src": "https://github.com/tpope/vim-rhubarb"
    },
    "vscode.nvim": {
      "src": "https://github.com/Mofiqul/vscode.nvim"
    },
    "wtf.nvim": {
      "src": "https://github.com/piersolenski/wtf.nvim"
    }
  }
}
